#+TODO: TODO UNDERWAY NEEDS_REVIEW | DONE CANCELLED DEFERRED

Developing the org-publish-meta application incrementally, step-by-step.

**** CANCELLED Plist version
CLOSED: [2013-12-16 Mon 04:08]
:PROPERTIES:
:DATE:     <2013-12-16 Mon 03:56>
:END:
The plists do not have to have symbols as keys, if I use lax-plist-get and lax-plist-put instead of plist-get and plist-put.  See: http://www.gnu.org/software/emacs/manual/html_node/elisp/Plist-Access.html

Testing here:

#+BEGIN_SRC elisp
(setq alpha '("alpha" 1 2 3))

(setcdr alpha (cons 123 (cdr alpha)))

Also note:

(setq test (remove* "alpha" test :test 'equal :key 'car))

#+END_SRC

#+RESULTS:
| alpha | 123 | 1 | 2 | 3 |

Suppose the alist entry of a project is of the form:

#+BEGIN_SRC elisp
  (setq
   ptest
   '(
     ("projectalpha" :file1 nil :nodex "folderx")
     ("project2" :file2 "foldern" :nodex nil)
     )
  )
#+END_SRC

#+RESULTS:
| projectalpha | :file1 | nil     | :nodex | folderx |
| project2     | :file2 | foldern | :nodex | nil     |

Trying to edit:

#+BEGIN_SRC elisp
  (let* ((alist (assoc "projectalpha" ptest ))
         (plist (cdr alist)))
    (setcdr alist (plist-put plist :newfile "newfolder")))
  ptest
#+END_SRC

#+RESULTS:
| projectalpha | :file1 | nil     | :nodex | folderx | :newfile | newfolder |
| project2     | :file2 | foldern | :nodex | nil     |          |           |

#+BEGIN_SRC elisp
  (let* ((alist (assoc "projectalpha" ptest ))
         (plist (cdr alist)))
    (setcdr alist (plist-put plist :newfile "newfolder")))
  ptest
#+END_SRC

**** UNDERWAY Alist version
:PROPERTIES:
:DATE:     <2013-12-16 Mon 03:56>
:END:

#+BEGIN_SRC elisp
  (setq
   atest
   '(
     ("projectalpha" ("file1") ("nodex" . "folderx"))
     ("project2"  ("file2" . "foldery") ("nodex"))
     )
  )
#+END_SRC

#+RESULTS:
| projectalpha | (file1)           | (nodex . folderx) |
| project2     | (file2 . foldery) | (nodex)           |

***** Trying to edit:

#+BEGIN_SRC elisp
  (let* ((all (assoc "projectalpha" atest ))
         (pairs (cdr all))
         (node (assoc "nodex" pairs))
         )
    (setcdr all (delq node pairs)))
  atest
#+END_SRC

#+RESULTS:
| projectalpha | (file1)           |         |
| project2     | (file2 . foldery) | (nodex) |

*** Tests of auxiliary functions 1
:PROPERTIES:
:DATE:     <2013-12-16 Mon 04:51>
:END:
#+BEGIN_SRC elisp
  (setq org-pm-files nil)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC elisp
(org-pm-remove-component "alpha" "index")
org-pm-files
#+END_SRC

#+RESULTS:
| alpha |

#+BEGIN_SRC elisp
  (setq org-pm-files
        '(("alpha" ("index" . "")))
  )
#+END_SRC

#+RESULTS:
| alpha | (index . ) |

#+BEGIN_SRC elisp
(org-pm-add-component "project1" "index" "")
org-pm-files
#+END_SRC

#+RESULTS:
| project1 | (index . ) |
| alpha    |            |

#+BEGIN_SRC elisp
(org-pm-add-component "project1" "chapter1" "chapters")
org-pm-files
#+END_SRC

#+RESULTS:
| project1 | (chapter1 . chapters) | (index . ) |
| alpha    |                       |            |

#+BEGIN_SRC elisp
(org-pm-add-component "project1" "chapter1" "")
org-pm-files
#+END_SRC

#+RESULTS:
| project1 | (chapter1 . ) | (index . ) |
| alpha    |               |            |

#+BEGIN_SRC elisp
(org-pm-remove-component "project1" "chapter1")
org-pm-files
#+END_SRC

#+RESULTS:
| project1 | (index . ) |
| alpha    |            |

#+BEGIN_SRC elisp
(org-pm-add-component "alpha" "index" "")
(org-pm-add-component "alpha" "index::node1" "")
(org-pm-add-component "project2" "other-file" "")
(org-pm-add-component "alpha" "other-file-3" "")
org-pm-files
#+END_SRC

#+RESULTS:
| project2 | (other-file . )   |                   |            |
| project1 | (index . )        |                   |            |
| alpha    | (other-file-3 . ) | (index::node1 . ) | (index . ) |

#+BEGIN_SRC elisp
  (org-pm-get-file-components "index")
#+END_SRC
#+RESULTS:
| project1 | (index . ) |                   |
| alpha    | (index . ) | (index::node1 . ) |

#+BEGIN_SRC elisp
(setq assoc-add-test nil)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC elisp
(setq assoc-add-test (assoc-add assoc-add-test "key1" "value1"))
#+END_SRC

#+RESULTS:
| key1 | value1 |

#+BEGIN_SRC elisp
(setq assoc-add-test (assoc-add assoc-add-test "key1" "value2"))
#+END_SRC

#+RESULTS:
| key1 | value2 | value1 |

#+BEGIN_SRC elisp
(setq assoc-add-test (assoc-add assoc-add-test "key3" "value5"))
#+END_SRC

#+RESULTS:
| key1 | value2 | value1 |
| key3 | value5 |        |

#+BEGIN_SRC elisp
(setq assoc-add-test (assoc-add assoc-add-test "key3" "value3"))
#+END_SRC

#+RESULTS:
| key1 | value2 | value1 |
| key3 | value3 | value5 |

#+BEGIN_SRC elisp
(setq assoc-add-test (assoc-add assoc-add-test "key3" "value7"))
#+END_SRC

#+RESULTS:
| key1 | value2 | value1 |        |
| key3 | value7 | value3 | value5 |


#+BEGIN_SRC elisp
assoc-add-test
#+END_SRC
#+RESULTS:

#+BEGIN_SRC elisp
(setcdr nil 1)
#+END_SRC

* Earlier project def parsing tests
:PROPERTIES:
:DATE:     <2013-12-16 Mon 01:56>
:END:
#+BEGIN_SRC elisp
(org-pm-make-default-project-plist)
#+END_SRC

#+BEGIN_SRC elisp
(org-pm-make-projects)
#+END_SRC
#+RESULTS:
| project2    | :base-directory | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/org | :base-extension | org | :publishing-directory | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/html | :recursive | t | :publishing-function | org-publish-org-to-html | :headline-levels | 5 | :auto-preamble | t | :project-name | project2    | :node-id | 2260C2D9-268F-4A0B-8F02-BD70445988A1 | :node-filename | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/step-by-step.org | :more      |               123 |                           |                     |         |     |
| project1    | :base-directory | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/org | :base-extension | org | :publishing-directory | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/html | :recursive | t | :publishing-function | org-publish-org-to-html | :headline-levels | 5 | :auto-preamble | t | :project-name | project1    | :node-id | 2260C2D9-268F-4A0B-8F02-BD70445988A1 | :node-filename | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/step-by-step.org | :the_title | (with many types) | :title_with_one_type_only | but some contents\n | :title2 | nil |
| Project 323 | :base-directory | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/org | :base-extension | org | :publishing-directory | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/html | :recursive | t | :publishing-function | org-publish-org-to-html | :headline-levels | 5 | :auto-preamble | t | :project-name | Project 323 | :node-id | 2260C2D9-268F-4A0B-8F02-BD70445988A1 | :node-filename | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/step-by-step.org |            |                   |                           |                     |         |     |


* More recent tests

#+BEGIN_SRC elisp
 (org-pm-make-projects)
#+END_SRC

#+RESULTS:
| Project 323 | :base-extension | org | :recursive | t | :publishing-function | org-publish-org-to-html | :headline-levels | 5 | :auto-preamble | t | :base-directory | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/org | :publishing-directory | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/html | :project-name | Project 323 | :node-id | 42737B2C-54FD-40EC-9DF0-0F3CD10EBB64 | :node-filename | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/step-by-step.org | :xonwrwan  |            123123 |                           |                     |         |     |
| project2    | :base-extension | org | :recursive | t | :publishing-function | org-publish-org-to-html | :headline-levels | 5 | :auto-preamble | t | :base-directory | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/org | :publishing-directory | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/html | :project-name | project2    | :node-id | 5853E3D5-82E5-4CCF-89A5-A53E0BC8281B | :node-filename | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/step-by-step.org | :more      |               123 |                           |                     |         |     |
| project1    | :base-extension | org | :recursive | t | :publishing-function | org-publish-org-to-html | :headline-levels | 5 | :auto-preamble | t | :base-directory | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/org | :publishing-directory | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/html | :project-name | project1    | :node-id | 5853E3D5-82E5-4CCF-89A5-A53E0BC8281B | :node-filename | /Users/iani2/Documents/Dev/Emacs/org-publish-meta/step-by-step.org | :the_title | (with many types) | :title_with_one_type_only | but some contents\n | :title2 | nil |
